app/controllers/locations_controller.rb

  def index
    @page.title = t('location.title')
    # @locations = Location.find(:all, :conditions => "horizontal_accuracy < 80", :order => "created_at DESC", :limit => 10 )#, :limit => '50'.reverse
    @location = Location.last
---
SELECT * FROM `locations` WHERE (horizontal_accuracy < 50) ORDER BY created_at DESC LIMIT 50

  def create
    logger.debug request.env["HTTP_USER_AGENT"]
    # if request.env["HTTP_USER_AGENT"] == "beriedataphone"
      @location = Location.new(params[:location])

      if @location.save
---
INSERT INTO `locations` (`latitude`, `updated_at`, `altitude`, `vertical_accuracy`, `longitude`, `horizontal_accuracy`, `created_at`) VALUES(52.253037, '2008-11-26 19:51:00', 0.0, 1.0, 6.160507, 2328.0, '2008-11-26 19:51:00')